humanPulmonaryArteriesFSI/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs            ("libwindkesselPressure.so");

application     solids4Foam;

startFrom      latestTime; // startTime;

startTime       0;

stopAt          endTime;

endTime         2.5;

deltaT          5e-4;

writeControl    runTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;
fileHandler     uncollated;

functions
{
    // displacement
    // {
    //     type            solidPointDisplacement;
    //     region          solid;
    //     point           (0 0.005 0.025);
    // }
         patchDisplacements
     {
         type            solidDisplacements;
         historyPatch    innerWall;
     }

           pressureProbe
     {
       type probes;
       region fluid;
       libs (sampling);
       
       writeControl timeStep;
       writeInterval 1;
       
       fields (p);
       probeLocations
	 (
 	   (0.04 -0.008 0.065) //MPA
	  );
     }
    solidForce
    {
        type           solidForces;
	region solid;
        historyPatch   innerWall;
    }
    forces
    {
        type                forces;
        libs                ( "libforces.so" );
        writeControl        timeStep;
        writeInterval       1;
        patches             (wall);
        "pName|p"           p;
        "UName|U"           U;
        "rhoName|rho"       rhoInf;
        log                 false;
        rhoInf              1000;
        CofR                (0.5 0.1 0);
        region              fluid;
    }
    fsiConvData
    {
        type fsiConvergenceData;
        region fluid;
    }
    courantNo
      {
	type CourantNo;
	libs (fieldFunctionObjects);

	writeControl timeStep;
	writeInterval 1;
      }
            wallShearStress1
    {
        // Mandatory entries
        type            wallShearStress;
	region fluid;
        libs            (fieldFunctionObjects);

        // Optional entries
        patches         (wall);
        writeFields     yes;

        // Optional (inherited) entries
        writePrecision  10;
	// writeControl    writeTime;
        // writeInterval   -1;
	writeControl    runTime;
	writeInterval   0.05;

    }

    oscillatoryShearIndex1
    {
        // Mandatory entries
        type            oscillatoryShearIndex;
	region fluid;
        libs            (oscillatoryShearIndex);

        // Optional entries
        patches         (wall);
        writeFields     yes;

        // Optional (inherited) entries
        writePrecision  10;
        // writeControl    writeTime;
        // writeInterval   -1;
	writeControl    runTime;
	writeInterval   0.05;

    }        

	
}

DebugSwitches
{
    elasticWallPressure  1;
}

DebugSwitches
{
    elasticWallPressure  1;
}

// ************************************************************************* //
