humanPulmonaryArteriesFSI/constant/fsiProperties
fsiProperties.pimpleFluid