humanPulmonaryArteriesFSI/0/fluid.pimpleFluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  processor
    {
      type processor;
    }
  "auto.*"
    {
      type inletOutlet;// type         fluxCorrectedVelocity;
      value uniform (0 0 0);
      inletValue uniform (0 0 0);
    }
  
    inlet
    {
        type     flowRateInletVelocity;
	volumetricFlowRate  table
	  (
(	0	0	        )
(	0.01	0.00001105	)
(	0.02	0.0000271	)
(	0.03	0.00004877	)
(	0.04	0.00007565	)
(	0.05	0.00010639	)
(	0.06	0.00013965	)
(	0.07	0.00017165	)
(	0.08	0.00020055	)
(	0.09	0.00022555	)
(	0.1	0.00024572	)
(	0.11	0.00025968	)
(	0.12	0.00026841	)
(	0.13	0.00027223	)
(	0.14	0.00027223	)
(	0.15	0.00026833	)
(	0.16	0.00026331	)
(	0.17	0.00025648	)
(	0.18	0.00024827	)
(	0.19	0.00023876	)
(	0.2	0.00022835	)
(	0.21	0.00021752	)
(	0.22	0.00020617	)
(	0.23	0.0001955	)
(	0.24	0.00018423	)
(	0.25	0.00017217	)
(	0.26	0.00016029	)
(	0.27	0.00014721	)
(	0.28	0.00013298	)
(	0.29	0.00011854	)
(	0.3	0.00010236	)
(	0.31	0.00008436	)
(	0.32	0.00006639	)
(	0.33	0.00004944	)
(	0.34	0.00003517	)
(	0.35	0.00002115	)
(	0.36	0.00001059	)
(	0.37	0.0000031	)
(	0.38	-0.00000315	)
(	0.39	-0.00000894	)
(	0.4	-0.00001249	)
(	0.41	-0.00001523	)
(	0.42	-0.00001714	)
(	0.43	-0.00001774	)
(	0.44	-0.00001674	)
(	0.45	-0.0000154	)
(	0.46	-0.00001286	)
(	0.47	-0.00001032	)
(	0.48	-0.00000723	)
(	0.49	-0.0000049	)
(	0.5	-0.00000203	)
(	0.51	-0.00000023	)
(	0.52	0.00000115	)
(	0.53	0.00000323	)
(	0.54	0.00000327	)
(	0.55	0.00000327	)
(	0.56	0.00000327	)
(	0.57	0.00000327	)
(	0.58	0.00000327	)
(	0.59	0.00000327	)
(	0.6	0.00000327	)
(	0.61	0.00000327	)
(	0.62	0.00000327	)
(	0.63	0.00000327	)
(	0.64	0.00000327	)
(	0.65	0.00000272	)
(	0.66	0.00000327	)
(	0.67	0.00000268	)
(	0.68	0.00000268	)
(	0.69	0.00000268	)
(	0.7	0.00000268	)
(	0.71	0.00000268	)
(	0.72	0.00000268	)
(	0.73	0.0000021	)
(	0.74	0.0000021	)
(	0.75	0.0000021	)
(	0.76	0.0000021	)
(	0.77	0.0000021	)
(	0.78	0.0000021	)
(	0.79	0.0000021	)
(	0.8	0.0000021	)
(	0.81	0.00000152	)
(	0.82	0.0000002	)
(	0.83	-0.00000117	)
(	0.84	-0.00000314	)
(	0.85	-0.0000049	)
(	0.86	-0.0000049	)
	  
	  );
	outOfBounds repeat;
	  value uniform (0 0 0);

    }
    "wall.*"
    {
        // Dirichlet-Neumann approach
        type         newMovingWallVelocity;
        value        uniform (0 0 0);

        // Robin-Neumann condition approach
        // type         elasticWallVelocity;
        // value        uniform (0 0 0);
    }
}

// ************************************************************************* //
