humanPulmonaryArteriesFSI/0/fluid.pimpleFluid/pointMotionU
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointMotionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  processor
    {
      type processor;
    }
  
    "auto.*"
    {
        type         fixedValue;
        value        uniform (0 0 0);
    }
    inlet
    {
        type         fixedValue;
        value        uniform (0 0 0);
    }
    "wall.*"
    {
        type         fixedValue;
        value        uniform (0 0 0);
    }
}

// ************************************************************************* //
