humanPulmonaryArteriesFSI/0/solid/pointD
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointD;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  processor
    {
      type processor;
    }

    "auto.*"
    {
      type              slip;//fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
      type              slip;//fixedValue;//slip;//fixedValue;
        value           uniform (0 0 0);
    }
    innerWall
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outerWall
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
